# 尺寸映射表
SIZE_MAP = {
    "1K": {
        "1:1": "1024x1024",
        "4:3": "1152x864",
        "3:4": "864x1152",
        "16:9": "1424x800",
        "9:16": "800x1424",
        "3:2": "1248x832",
        "2:3": "832x1248",
        "21:9": "1568x672",
    },
    "2K": {
        "1:1": "2048x2048",
        "4:3": "2368x1776",
        "3:4": "1776x2368",
        "16:9": "2816x1584",
        "9:16": "1584x2816",
        "3:2": "2496x1664",
        "2:3": "1664x2496",
        "21:9": "3136x1344",
    }
    # 后续需要4K直接在这里追加
}
def getImageSize(size: str, proportion: str):
    """根据图片尺寸宽高比计算图片尺寸"""
    size = "1K" if size == "1080p" else size
    tier_map = SIZE_MAP.get(size)
    if not tier_map:
        return "1024x1024" # 默认1024x1024 1k 1:1比例
    return tier_map.get(proportion)